; domain
(define (domain drone-domain)


(:requirements :strips :typing )


(:types
    person crate food medicine location drone - object
)


(:predicates
    (at ?o - object ?l - location)
    (crate-content ?b - crate ?content - object)
    (person-needs ?p - person ?content - object)
    (person-has ?p - person ?content - object)
    (arm1-free ?d - drone)
    (arm1-load ?d - drone ?b - crate)
    (arm2-free ?d - drone)
    (arm2-load ?d - drone ?b - crate)
)


(:action move-drone
    :parameters (
        ?drone - drone ?origin - location ?destination - location 
    )
    :precondition (and 
        (at ?drone ?origin)
    )
    :effect (and 
        (not (at ?drone ?origin))
        (at ?drone ?destination)
    )
)

(:action grab-arm1
    :parameters (
        ?d - drone ?b - crate ?l - location
    )
    :precondition (and 
        (at ?d ?l)
        (at ?b ?l)
        (arm1-free ?d)
    )
    :effect (and 
        (not (arm1-free ?d))
        (arm1-load ?d ?b)
        (not (at ?b ?l))
    )
)

(:action grab-arm2
    :parameters (
        ?d - drone ?b - crate ?l - location
    )
    :precondition (and 
        (at ?d ?l)
        (at ?b ?l)
        (arm2-free ?d)
    )
    :effect (and 
        (not (arm2-free ?d))
        (arm2-load ?d ?b)
        (not (at ?b ?l))
    )
)

(:action deliver-arm1
    :parameters (
        ?d - drone ?p - person ?b - crate ?content - object ?l - location
    )
    :precondition (and 
        (arm1-load ?d ?b)
        (at ?d ?l)
        (at ?p ?l)
        (crate-content ?b ?content)
        (person-needs ?p ?content)
    )
    :effect (and 
        (not (arm1-load ?d ?b))
        (arm1-free ?d)
        (not (person-needs ?p ?content))
        (person-has ?p ?content)
    )
)

(:action deliver-arm2
    :parameters (
        ?d - drone ?p - person ?b - crate ?content - object ?l - location
    )
    :precondition (and 
        (arm2-load ?d ?b)
        (at ?d ?l)
        (at ?p ?l)
        (crate-content ?b ?content)
        (person-needs ?p ?content)
    )
    :effect (and 
        (not (arm2-load ?d ?b))
        (arm2-free ?d)
        (not (person-needs ?p ?content))
        (person-has ?p ?content)
    )
)


)

; problem
(define (problem drone_problem_d1_r0_l24_p24_c24_g24_ct2)
(:domain drone-domain)
(:objects
	drone1 - drone
	depot - location
	loc1 - location
	loc2 - location
	loc3 - location
	loc4 - location
	loc5 - location
	loc6 - location
	loc7 - location
	loc8 - location
	loc9 - location
	loc10 - location
	loc11 - location
	loc12 - location
	loc13 - location
	loc14 - location
	loc15 - location
	loc16 - location
	loc17 - location
	loc18 - location
	loc19 - location
	loc20 - location
	loc21 - location
	loc22 - location
	loc23 - location
	loc24 - location
	crate1 - crate
	crate2 - crate
	crate3 - crate
	crate4 - crate
	crate5 - crate
	crate6 - crate
	crate7 - crate
	crate8 - crate
	crate9 - crate
	crate10 - crate
	crate11 - crate
	crate12 - crate
	crate13 - crate
	crate14 - crate
	crate15 - crate
	crate16 - crate
	crate17 - crate
	crate18 - crate
	crate19 - crate
	crate20 - crate
	crate21 - crate
	crate22 - crate
	crate23 - crate
	crate24 - crate
	food - contents
	medicine - contents
	person1 - person
	person2 - person
	person3 - person
	person4 - person
	person5 - person
	person6 - person
	person7 - person
	person8 - person
	person9 - person
	person10 - person
	person11 - person
	person12 - person
	person13 - person
	person14 - person
	person15 - person
	person16 - person
	person17 - person
	person18 - person
	person19 - person
	person20 - person
	person21 - person
	person22 - person
	person23 - person
	person24 - person
)
(:init
	(at drone1 depot)
	(arm1-free drone1)
	(arm2-free drone1)
	(at crate1 depot)
	(at crate2 depot)
	(at crate3 depot)
	(at crate4 depot)
	(at crate5 depot)
	(at crate6 depot)
	(at crate7 depot)
	(at crate8 depot)
	(at crate9 depot)
	(at crate10 depot)
	(at crate11 depot)
	(at crate12 depot)
	(at crate13 depot)
	(at crate14 depot)
	(at crate15 depot)
	(at crate16 depot)
	(at crate17 depot)
	(at crate18 depot)
	(at crate19 depot)
	(at crate20 depot)
	(at crate21 depot)
	(at crate22 depot)
	(at crate23 depot)
	(at crate24 depot)
	(crate-content crate1 food)
	(crate-content crate2 food)
	(crate-content crate3 food)
	(crate-content crate4 food)
	(crate-content crate5 food)
	(crate-content crate6 food)
	(crate-content crate7 food)
	(crate-content crate8 food)
	(crate-content crate9 food)
	(crate-content crate10 medicine)
	(crate-content crate11 medicine)
	(crate-content crate12 medicine)
	(crate-content crate13 medicine)
	(crate-content crate14 medicine)
	(crate-content crate15 medicine)
	(crate-content crate16 medicine)
	(crate-content crate17 medicine)
	(crate-content crate18 medicine)
	(crate-content crate19 medicine)
	(crate-content crate20 medicine)
	(crate-content crate21 medicine)
	(crate-content crate22 medicine)
	(crate-content crate23 medicine)
	(crate-content crate24 medicine)
	(at person1 loc16)
	(at person2 loc17)
	(at person3 loc7)
	(at person4 loc19)
	(at person5 loc4)
	(at person6 loc18)
	(at person7 loc12)
	(at person8 loc21)
	(at person9 loc9)
	(at person10 loc6)
	(at person11 loc18)
	(at person12 loc10)
	(at person13 loc16)
	(at person14 loc12)
	(at person15 loc20)
	(at person16 loc16)
	(at person17 loc5)
	(at person18 loc7)
	(at person19 loc4)
	(at person20 loc20)
	(at person21 loc1)
	(at person22 loc16)
	(at person23 loc16)
	(at person24 loc18)
	(person-needs person1 food)
	(person-needs person2 food)
	(person-needs person3 food)
	(person-needs person3 medicine)
	(person-needs person4 medicine)
	(person-needs person5 medicine)
	(person-needs person6 medicine)
	(person-needs person7 food)
	(person-needs person7 medicine)
	(person-needs person8 food)
	(person-needs person9 medicine)
	(person-needs person10 medicine)
	(person-needs person11 food)
	(person-needs person12 medicine)
	(person-needs person13 food)
	(person-needs person14 medicine)
	(person-needs person16 food)
	(person-needs person16 medicine)
	(person-needs person17 food)
	(person-needs person17 medicine)
	(person-needs person20 medicine)
	(person-needs person21 medicine)
	(person-needs person23 medicine)
	(person-needs person24 medicine)
)
(:goal (and
	(at drone1 depot)
	(person-has person1 food)
	(person-has person2 food)
	(person-has person3 food)
	(person-has person3 medicine)
	(person-has person4 medicine)
	(person-has person5 medicine)
	(person-has person6 medicine)
	(person-has person7 food)
	(person-has person7 medicine)
	(person-has person8 food)
	(person-has person9 medicine)
	(person-has person10 medicine)
	(person-has person11 food)
	(person-has person12 medicine)
	(person-has person13 food)
	(person-has person14 medicine)
	(person-has person16 food)
	(person-has person16 medicine)
	(person-has person17 food)
	(person-has person17 medicine)
	(person-has person20 medicine)
	(person-has person21 medicine)
	(person-has person23 medicine)
	(person-has person24 medicine)
	))
)

; plan
1. (grab-arm2 drone1 crate9 depot)
   deleted: (arm2-free drone1) (at crate9 depot)
   added: (arm2-load drone1 crate9)
   goals met: 1 of 25
2. (grab-arm1 drone1 crate24 depot)
   deleted: (arm1-free drone1) (at crate24 depot)
   added: (arm1-load drone1 crate24)
   goals met: 1 of 25
3. (move-drone drone1 depot loc17)
   deleted: (at drone1 depot)
   added: (at drone1 loc17)
   goals met: 0 of 25
4. (deliver-arm2 drone1 person2 crate9 food loc17)
   deleted: (arm2-load drone1 crate9) (person-needs person2 food)
   added: (arm2-free drone1) (person-has person2 food)
   goals met: 1 of 25
5. (move-drone drone1 loc17 loc19)
   deleted: (at drone1 loc17)
   added: (at drone1 loc19)
   goals met: 1 of 25
6. (move-drone drone1 loc19 depot)
   deleted: (at drone1 loc19)
   added: (at drone1 depot)
   goals met: 2 of 25
7. (grab-arm2 drone1 crate8 depot)
   deleted: (arm2-free drone1) (at crate8 depot)
   added: (arm2-load drone1 crate8)
   goals met: 2 of 25
8. (move-drone drone1 depot loc19)
   deleted: (at drone1 depot)
   added: (at drone1 loc19)
   goals met: 1 of 25
9. (deliver-arm1 drone1 person4 crate24 medicine loc19)
   deleted: (arm1-load drone1 crate24) (person-needs person4 medicine)
   added: (arm1-free drone1) (person-has person4 medicine)
   goals met: 2 of 25
10. (move-drone drone1 loc19 loc21)
   deleted: (at drone1 loc19)
   added: (at drone1 loc21)
   goals met: 2 of 25
11. (deliver-arm2 drone1 person8 crate8 food loc21)
   deleted: (arm2-load drone1 crate8) (person-needs person8 food)
   added: (arm2-free drone1) (person-has person8 food)
   goals met: 3 of 25
12. (move-drone drone1 loc21 loc7)
   deleted: (at drone1 loc21)
   added: (at drone1 loc7)
   goals met: 3 of 25
13. (move-drone drone1 loc7 depot)
   deleted: (at drone1 loc7)
   added: (at drone1 depot)
   goals met: 4 of 25
14. (grab-arm2 drone1 crate7 depot)
   deleted: (arm2-free drone1) (at crate7 depot)
   added: (arm2-load drone1 crate7)
   goals met: 4 of 25
15. (grab-arm1 drone1 crate23 depot)
   deleted: (arm1-free drone1) (at crate23 depot)
   added: (arm1-load drone1 crate23)
   goals met: 4 of 25
16. (move-drone drone1 depot loc4)
   deleted: (at drone1 depot)
   added: (at drone1 loc4)
   goals met: 3 of 25
17. (deliver-arm1 drone1 person5 crate23 medicine loc4)
   deleted: (arm1-load drone1 crate23) (person-needs person5 medicine)
   added: (arm1-free drone1) (person-has person5 medicine)
   goals met: 4 of 25
18. (move-drone drone1 loc4 loc7)
   deleted: (at drone1 loc4)
   added: (at drone1 loc7)
   goals met: 4 of 25
19. (move-drone drone1 loc7 depot)
   deleted: (at drone1 loc7)
   added: (at drone1 depot)
   goals met: 5 of 25
20. (grab-arm1 drone1 crate22 depot)
   deleted: (arm1-free drone1) (at crate22 depot)
   added: (arm1-load drone1 crate22)
   goals met: 5 of 25
21. (move-drone drone1 depot loc9)
   deleted: (at drone1 depot)
   added: (at drone1 loc9)
   goals met: 4 of 25
22. (deliver-arm1 drone1 person9 crate22 medicine loc9)
   deleted: (arm1-load drone1 crate22) (person-needs person9 medicine)
   added: (arm1-free drone1) (person-has person9 medicine)
   goals met: 5 of 25
23. (move-drone drone1 loc9 loc7)
   deleted: (at drone1 loc9)
   added: (at drone1 loc7)
   goals met: 5 of 25
24. (move-drone drone1 loc7 depot)
   deleted: (at drone1 loc7)
   added: (at drone1 depot)
   goals met: 6 of 25
25. (grab-arm1 drone1 crate21 depot)
   deleted: (arm1-free drone1) (at crate21 depot)
   added: (arm1-load drone1 crate21)
   goals met: 6 of 25
26. (move-drone drone1 depot loc6)
   deleted: (at drone1 depot)
   added: (at drone1 loc6)
   goals met: 5 of 25
27. (deliver-arm1 drone1 person10 crate21 medicine loc6)
   deleted: (arm1-load drone1 crate21) (person-needs person10 medicine)
   added: (arm1-free drone1) (person-has person10 medicine)
   goals met: 6 of 25
28. (move-drone drone1 loc6 loc7)
   deleted: (at drone1 loc6)
   added: (at drone1 loc7)
   goals met: 6 of 25
29. (move-drone drone1 loc7 depot)
   deleted: (at drone1 loc7)
   added: (at drone1 depot)
   goals met: 7 of 25
30. (grab-arm1 drone1 crate20 depot)
   deleted: (arm1-free drone1) (at crate20 depot)
   added: (arm1-load drone1 crate20)
   goals met: 7 of 25
31. (move-drone drone1 depot loc10)
   deleted: (at drone1 depot)
   added: (at drone1 loc10)
   goals met: 6 of 25
32. (deliver-arm1 drone1 person12 crate20 medicine loc10)
   deleted: (arm1-load drone1 crate20) (person-needs person12 medicine)
   added: (arm1-free drone1) (person-has person12 medicine)
   goals met: 7 of 25
33. (move-drone drone1 loc10 loc7)
   deleted: (at drone1 loc10)
   added: (at drone1 loc7)
   goals met: 7 of 25
34. (move-drone drone1 loc7 depot)
   deleted: (at drone1 loc7)
   added: (at drone1 depot)
   goals met: 8 of 25
35. (grab-arm1 drone1 crate19 depot)
   deleted: (arm1-free drone1) (at crate19 depot)
   added: (arm1-load drone1 crate19)
   goals met: 8 of 25
36. (move-drone drone1 depot loc20)
   deleted: (at drone1 depot)
   added: (at drone1 loc20)
   goals met: 7 of 25
37. (deliver-arm1 drone1 person20 crate19 medicine loc20)
   deleted: (arm1-load drone1 crate19) (person-needs person20 medicine)
   added: (arm1-free drone1) (person-has person20 medicine)
   goals met: 8 of 25
38. (move-drone drone1 loc20 loc7)
   deleted: (at drone1 loc20)
   added: (at drone1 loc7)
   goals met: 8 of 25
39. (move-drone drone1 loc7 depot)
   deleted: (at drone1 loc7)
   added: (at drone1 depot)
   goals met: 9 of 25
40. (grab-arm1 drone1 crate18 depot)
   deleted: (arm1-free drone1) (at crate18 depot)
   added: (arm1-load drone1 crate18)
   goals met: 9 of 25
41. (move-drone drone1 depot loc1)
   deleted: (at drone1 depot)
   added: (at drone1 loc1)
   goals met: 8 of 25
42. (deliver-arm1 drone1 person21 crate18 medicine loc1)
   deleted: (arm1-load drone1 crate18) (person-needs person21 medicine)
   added: (arm1-free drone1) (person-has person21 medicine)
   goals met: 9 of 25
43. (move-drone drone1 loc1 loc7)
   deleted: (at drone1 loc1)
   added: (at drone1 loc7)
   goals met: 9 of 25
44. (move-drone drone1 loc7 depot)
   deleted: (at drone1 loc7)
   added: (at drone1 depot)
   goals met: 10 of 25
45. (grab-arm1 drone1 crate17 depot)
   deleted: (arm1-free drone1) (at crate17 depot)
   added: (arm1-load drone1 crate17)
   goals met: 10 of 25
46. (move-drone drone1 depot loc7)
   deleted: (at drone1 depot)
   added: (at drone1 loc7)
   goals met: 9 of 25
47. (deliver-arm2 drone1 person3 crate7 food loc7)
   deleted: (arm2-load drone1 crate7) (person-needs person3 food)
   added: (arm2-free drone1) (person-has person3 food)
   goals met: 10 of 25
48. (move-drone drone1 loc7 depot)
   deleted: (at drone1 loc7)
   added: (at drone1 depot)
   goals met: 11 of 25
49. (grab-arm2 drone1 crate6 depot)
   deleted: (arm2-free drone1) (at crate6 depot)
   added: (arm2-load drone1 crate6)
   goals met: 11 of 25
50. (move-drone drone1 depot loc7)
   deleted: (at drone1 depot)
   added: (at drone1 loc7)
   goals met: 10 of 25
51. (deliver-arm1 drone1 person3 crate17 medicine loc7)
   deleted: (arm1-load drone1 crate17) (person-needs person3 medicine)
   added: (arm1-free drone1) (person-has person3 medicine)
   goals met: 11 of 25
52. (move-drone drone1 loc7 loc12)
   deleted: (at drone1 loc7)
   added: (at drone1 loc12)
   goals met: 11 of 25
53. (move-drone drone1 loc12 depot)
   deleted: (at drone1 loc12)
   added: (at drone1 depot)
   goals met: 12 of 25
54. (grab-arm1 drone1 crate16 depot)
   deleted: (arm1-free drone1) (at crate16 depot)
   added: (arm1-load drone1 crate16)
   goals met: 12 of 25
55. (move-drone drone1 depot loc12)
   deleted: (at drone1 depot)
   added: (at drone1 loc12)
   goals met: 11 of 25
56. (deliver-arm2 drone1 person7 crate6 food loc12)
   deleted: (arm2-load drone1 crate6) (person-needs person7 food)
   added: (arm2-free drone1) (person-has person7 food)
   goals met: 12 of 25
57. (move-drone drone1 loc12 depot)
   deleted: (at drone1 loc12)
   added: (at drone1 depot)
   goals met: 13 of 25
58. (grab-arm2 drone1 crate5 depot)
   deleted: (arm2-free drone1) (at crate5 depot)
   added: (arm2-load drone1 crate5)
   goals met: 13 of 25
59. (move-drone drone1 depot loc12)
   deleted: (at drone1 depot)
   added: (at drone1 loc12)
   goals met: 12 of 25
60. (deliver-arm1 drone1 person7 crate16 medicine loc12)
   deleted: (arm1-load drone1 crate16) (person-needs person7 medicine)
   added: (arm1-free drone1) (person-has person7 medicine)
   goals met: 13 of 25
61. (move-drone drone1 loc12 depot)
   deleted: (at drone1 loc12)
   added: (at drone1 depot)
   goals met: 14 of 25
62. (grab-arm1 drone1 crate15 depot)
   deleted: (arm1-free drone1) (at crate15 depot)
   added: (arm1-load drone1 crate15)
   goals met: 14 of 25
63. (move-drone drone1 depot loc12)
   deleted: (at drone1 depot)
   added: (at drone1 loc12)
   goals met: 13 of 25
64. (deliver-arm1 drone1 person14 crate15 medicine loc12)
   deleted: (arm1-load drone1 crate15) (person-needs person14 medicine)
   added: (arm1-free drone1) (person-has person14 medicine)
   goals met: 14 of 25
65. (move-drone drone1 loc12 loc5)
   deleted: (at drone1 loc12)
   added: (at drone1 loc5)
   goals met: 14 of 25
66. (move-drone drone1 loc5 depot)
   deleted: (at drone1 loc5)
   added: (at drone1 depot)
   goals met: 15 of 25
67. (grab-arm1 drone1 crate14 depot)
   deleted: (arm1-free drone1) (at crate14 depot)
   added: (arm1-load drone1 crate14)
   goals met: 15 of 25
68. (move-drone drone1 depot loc5)
   deleted: (at drone1 depot)
   added: (at drone1 loc5)
   goals met: 14 of 25
69. (deliver-arm2 drone1 person17 crate5 food loc5)
   deleted: (arm2-load drone1 crate5) (person-needs person17 food)
   added: (arm2-free drone1) (person-has person17 food)
   goals met: 15 of 25
70. (move-drone drone1 loc5 depot)
   deleted: (at drone1 loc5)
   added: (at drone1 depot)
   goals met: 16 of 25
71. (grab-arm2 drone1 crate4 depot)
   deleted: (arm2-free drone1) (at crate4 depot)
   added: (arm2-load drone1 crate4)
   goals met: 16 of 25
72. (move-drone drone1 depot loc5)
   deleted: (at drone1 depot)
   added: (at drone1 loc5)
   goals met: 15 of 25
73. (deliver-arm1 drone1 person17 crate14 medicine loc5)
   deleted: (arm1-load drone1 crate14) (person-needs person17 medicine)
   added: (arm1-free drone1) (person-has person17 medicine)
   goals met: 16 of 25
74. (move-drone drone1 loc5 loc16)
   deleted: (at drone1 loc5)
   added: (at drone1 loc16)
   goals met: 16 of 25
75. (move-drone drone1 loc16 depot)
   deleted: (at drone1 loc16)
   added: (at drone1 depot)
   goals met: 17 of 25
76. (grab-arm1 drone1 crate13 depot)
   deleted: (arm1-free drone1) (at crate13 depot)
   added: (arm1-load drone1 crate13)
   goals met: 17 of 25
77. (move-drone drone1 depot loc16)
   deleted: (at drone1 depot)
   added: (at drone1 loc16)
   goals met: 16 of 25
78. (deliver-arm2 drone1 person1 crate4 food loc16)
   deleted: (arm2-load drone1 crate4) (person-needs person1 food)
   added: (arm2-free drone1) (person-has person1 food)
   goals met: 17 of 25
79. (move-drone drone1 loc16 depot)
   deleted: (at drone1 loc16)
   added: (at drone1 depot)
   goals met: 18 of 25
80. (grab-arm2 drone1 crate3 depot)
   deleted: (arm2-free drone1) (at crate3 depot)
   added: (arm2-load drone1 crate3)
   goals met: 18 of 25
81. (move-drone drone1 depot loc16)
   deleted: (at drone1 depot)
   added: (at drone1 loc16)
   goals met: 17 of 25
82. (deliver-arm2 drone1 person13 crate3 food loc16)
   deleted: (arm2-load drone1 crate3) (person-needs person13 food)
   added: (arm2-free drone1) (person-has person13 food)
   goals met: 18 of 25
83. (move-drone drone1 loc16 depot)
   deleted: (at drone1 loc16)
   added: (at drone1 depot)
   goals met: 19 of 25
84. (grab-arm2 drone1 crate2 depot)
   deleted: (arm2-free drone1) (at crate2 depot)
   added: (arm2-load drone1 crate2)
   goals met: 19 of 25
85. (move-drone drone1 depot loc16)
   deleted: (at drone1 depot)
   added: (at drone1 loc16)
   goals met: 18 of 25
86. (deliver-arm2 drone1 person16 crate2 food loc16)
   deleted: (arm2-load drone1 crate2) (person-needs person16 food)
   added: (arm2-free drone1) (person-has person16 food)
   goals met: 19 of 25
87. (move-drone drone1 loc16 depot)
   deleted: (at drone1 loc16)
   added: (at drone1 depot)
   goals met: 20 of 25
88. (grab-arm2 drone1 crate1 depot)
   deleted: (arm2-free drone1) (at crate1 depot)
   added: (arm2-load drone1 crate1)
   goals met: 20 of 25
89. (move-drone drone1 depot loc18)
   deleted: (at drone1 depot)
   added: (at drone1 loc18)
   goals met: 19 of 25
90. (deliver-arm2 drone1 person11 crate1 food loc18)
   deleted: (arm2-load drone1 crate1) (person-needs person11 food)
   added: (arm2-free drone1) (person-has person11 food)
   goals met: 20 of 25
91. (deliver-arm1 drone1 person6 crate13 medicine loc18)
   deleted: (arm1-load drone1 crate13) (person-needs person6 medicine)
   added: (arm1-free drone1) (person-has person6 medicine)
   goals met: 21 of 25
92. (move-drone drone1 loc18 depot)
   deleted: (at drone1 loc18)
   added: (at drone1 depot)
   goals met: 22 of 25
93. (grab-arm2 drone1 crate12 depot)
   deleted: (arm2-free drone1) (at crate12 depot)
   added: (arm2-load drone1 crate12)
   goals met: 22 of 25
94. (move-drone drone1 depot loc18)
   deleted: (at drone1 depot)
   added: (at drone1 loc18)
   goals met: 21 of 25
95. (deliver-arm2 drone1 person24 crate12 medicine loc18)
   deleted: (arm2-load drone1 crate12) (person-needs person24 medicine)
   added: (arm2-free drone1) (person-has person24 medicine)
   goals met: 22 of 25
96. (move-drone drone1 loc18 loc16)
   deleted: (at drone1 loc18)
   added: (at drone1 loc16)
   goals met: 22 of 25
97. (move-drone drone1 loc16 depot)
   deleted: (at drone1 loc16)
   added: (at drone1 depot)
   goals met: 23 of 25
98. (grab-arm2 drone1 crate11 depot)
   deleted: (arm2-free drone1) (at crate11 depot)
   added: (arm2-load drone1 crate11)
   goals met: 23 of 25
99. (move-drone drone1 depot loc16)
   deleted: (at drone1 depot)
   added: (at drone1 loc16)
   goals met: 22 of 25
100. (deliver-arm2 drone1 person16 crate11 medicine loc16)
   deleted: (arm2-load drone1 crate11) (person-needs person16 medicine)
   added: (arm2-free drone1) (person-has person16 medicine)
   goals met: 23 of 25
101. (move-drone drone1 loc16 depot)
   deleted: (at drone1 loc16)
   added: (at drone1 depot)
   goals met: 24 of 25
102. (grab-arm2 drone1 crate10 depot)
   deleted: (arm2-free drone1) (at crate10 depot)
   added: (arm2-load drone1 crate10)
   goals met: 24 of 25
103. (move-drone drone1 depot loc16)
   deleted: (at drone1 depot)
   added: (at drone1 loc16)
   goals met: 23 of 25
104. (deliver-arm2 drone1 person23 crate10 medicine loc16)
   deleted: (arm2-load drone1 crate10) (person-needs person23 medicine)
   added: (arm2-free drone1) (person-has person23 medicine)
   goals met: 24 of 25
105. (move-drone drone1 loc16 depot)
   deleted: (at drone1 loc16)
   added: (at drone1 depot)
   goals met: 25 of 25
